import streamlit as st

st.title('Streamlitの基本')


# e-Stat（政府統計）のデータを使用
# CSV形式をそのまま使用してOK
# （高度なデータ加工は必須ではありません）

# 以下の要素を3つ以上含めること：
# ✓ アプリの概要‧目的‧使い方の説明
# ✓ データの確認（件数、期間、対象など）
# ✓ データの可視化（最低2種類のグラフ）
# ✓ 比較や傾向が分かる表示（地域差など）
# ✓ 可視化結果の簡単な解釈や説明

# ✓ サイドバー等で条件を変更できる
# ✓ 例：都道府県、年、期間、指標など
# ✓ ユーザ操作でグラフ等の表示が変化する
# ✓ 単位や補足説明を画面上に明示する

# 【授業で扱っていない部品を探す　公式API Reference を調査】
# 条件：最低3つ使用 必須
# 授業コードにない部品を選ぶ
# 機能的に意味のある使い方をする

# 【他アプリから着想を得る　公式サイトGallery / Explore を参照】
# 条件：アイデアを取り入れる 必須
# 優れたデザインや構成を真似ることで、アプリの品質を高めることが目
# 的です。